In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("raw_data.csv")
df

    name           email   age   join_date
0  Ahmad  ahmad@mail.com  25.0  2023-01-10
1   Budi   budi@mail.com   NaN  2023-02-15
2  Citra  citra@mail.com  30.0         NaN
3   Dewi             NaN  28.0  2023-03-01

In [3]:
df.isnull().sum()

name         0
email        1
age          1
join_date    1
dtype: int64

In [4]:
df_clean = df.dropna()
df_clean

    name           email   age   join_date
0  Ahmad  ahmad@mail.com  25.0  2023-01-10

In [6]:
df_clean.to_csv("clean_data.csv", index=False)